### Report for validate-metrics on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.74"...
- Installing hashicorp/aws v3.76.1...
- Installed hashicorp/aws v3.76.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (0 to add, 4 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.validate_metrics-cloudwatch-log-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "validate_metrics-cloudwatch-log-access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev-validate-metrics-lambda:*",
            ]
          + sid       = "CloudwatchLogs"
        }
    }

  # aws_cloudwatch_log_group.validate_metrics_logs_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "validate_metrics_logs_group" {
        id                = "/aws/lambda/dev-validate-metrics-lambda"
        name              = "/aws/lambda/dev-validate-metrics-lambda"
      ~ tags              = {
            "ApplicationRole"     = "AwsCloudwatchLogGroup"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-validate-metrics-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all          = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy.validate_metrics_cloudwatch_log_access will be updated in-place
  ~ resource "aws_iam_policy" "validate_metrics_cloudwatch_log_access" {
        id          = "arn:aws:iam::343515223843:policy/dev-validate-metrics-cloudwatch-log--access"
        name        = "dev-validate-metrics-cloudwatch-log--access"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-west-2:343515223843:log-group:/aws/lambda/dev-validate-metrics-lambda:*"
                      - Sid      = "CloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.validate_metrics_lambda will be updated in-place
  ~ resource "aws_lambda_function" "validate_metrics_lambda" {
      ~ filename                       = "/home/runner/work/prm-gp2gp-data-pipeline-infra/prm-gp2gp-data-pipeline-infra/lambda/build/validate-metrics.zip" -> "/home/runner/work/gp2gp-reporting-infrastructure/gp2gp-reporting-infrastructure/lambda/build/validate-metrics.zip"
        id                             = "dev-validate-metrics-lambda"
      ~ last_modified                  = "2025-05-22T13:51:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "qteAg438Ayryo+nPFwY0lbVRrd6lQhwCMFBGD4rfnZo=" -> "KHnOsQynT+CpP5GzRa1+Tyh1d14Qe9X33f9hlfOvtZI="
      ~ tags                           = {
            "ApplicationRole"     = "AwsLambdaFunction"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-validate-metrics-lambda"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all                       = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ssm_parameter.validate_metrics_lambda_arn will be updated in-place
  ~ resource "aws_ssm_parameter" "validate_metrics_lambda_arn" {
        id              = "/registrations/dev/data-pipeline/validate-metrics/lambda-arn"
        name            = "/registrations/dev/data-pipeline/validate-metrics/lambda-arn"
      ~ tags            = {
            "ApplicationRole"     = "AwsSsmParameter"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-validate-metrics-lambda-definition-arn"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.

```

</details>